In [3]:
import pandas as pd
df=pd.read_excel("//home//rguktrkvalley//Documents//E2//S2//DSP_LAB//Marks.xlsx")
print(df)

         NAME  AGE  WT  DSP  TOTAL
0        raju   23  30   34     64
1       surya   24  23   23     46
2       kiran   23  34   29     63
3         sam   35  23   40     63
4      sreenu   22  29   35     64
5        ajay   76  40   37     77
6       vijay   27  35   35     70
7     prabhas   30  37   29     66
8       bunny   28  37   26     63
9     anushka   25  36   24     60
10       pspk   37  35   23     58
11     mahesh   34  29   29     58
12        ntr   32  26   40     66
13  ramcharan   31  24   34     58
14        ntr   32  26   40     66
15       ntr    32  26   40     66
16    sreenu    45  67   89     23
17      kiran   23  34   29     63

In [9]:
#missing data
import pandas as pd
df=pd.read_excel("//home//rguktrkvalley//Documents//E2//S2//DSP_LAB//dataframe_missing.xlsx")
print(df)

   Student_ID  Age  Gender  High_School_GPA    Field_of_Study
0      S00001   24    Male             3.58              Arts
1      S00002   21   Other             2.52               Law
2      S00003   28  Female             3.42          Medicine
3      S00004   25    Male             2.43               NaN
4      S00005   22    Male             2.08       Engineering
..        ...  ...     ...              ...               ...
56     S00013   22  Female             2.06       Engineering
57     S00014   21    Male             3.21              Arts
58     S00015   25    Male             2.79          Business
59     S00016   25  Female             2.60  Computer Science
60     S00017   20  Female             3.73               Law

[61 rows x 5 columns]

In [11]:
print(df.dropna())

   Student_ID  Age  Gender  High_School_GPA    Field_of_Study
0      S00001   24    Male             3.58              Arts
1      S00002   21   Other             2.52               Law
2      S00003   28  Female             3.42          Medicine
4      S00005   22    Male             2.08       Engineering
5      S00006   24    Male             2.40               Law
6      S00007   27    Male             2.36  Computer Science
7      S00008   20    Male             2.68  Computer Science
9      S00010   28    Male             3.02  Computer Science
10     S00011   28  Female             2.95       Mathematics
11     S00012   25  Female             2.54               Law
12     S00013   22  Female             2.06       Engineering
13     S00014   21    Male             3.21              Arts
14     S00015   25    Male             2.79          Business
15     S00016   25  Female             2.60  Computer Science
16     S00017   20  Female             3.73               Law
18     S00019   22  Female             3.72       Mathematics
19     S00020   19  Female             2.99       Mathematics
20     S00021   25  Female             2.26          Medicine
21     S00022   29    Male             3.39          Business
22     S00023   23  Female             2.41       Engineering
23     S00024   19  Female             2.88          Medicine
24     S00025   29  Female             2.13       Engineering
25     S00026   22  Female             3.65          Medicine
26     S00027   18  Female             2.25              Arts
27     S00028   29  Female             3.81       Engineering
28     S00029   27    Male             3.73          Medicine
29     S00030   23  Female             2.93       Mathematics
30     S00031   29  Female             3.49       Engineering
31     S00032   26  Female             3.24          Business
32     S00033   18    Male             3.61       Engineering
33     S00034   28    Male             2.86               Law
34     S00035   28  Female             3.57       Engineering
35     S00036   27  Female             2.92          Medicine
36     S00037   29  Female             3.88       Engineering
37     S00038   29  Female             2.97              Arts
38     S00039   20  Female             2.93  Computer Science
39     S00040   29  Female             3.57          Business
40     S00041   24  Female             3.64               Law
41     S00042   21  Female             3.11       Mathematics
42     S00043   26  Female             2.36          Medicine
43     S00044   20    Male             2.94       Mathematics
44     S00045   22    Male             3.94       Mathematics
45     S00046   20  Female             3.51       Engineering
46     S00047   24    Male             3.62       Engineering
47     S00048   22    Male             2.07       Engineering
48     S00005   22    Male             2.08       Engineering
49     S00006   24    Male             2.40               Law
50     S00007   27    Male             2.36  Computer Science
51     S00008   20    Male             2.68  Computer Science
52     S00009   24    Male             2.84          Business
53     S00010   28    Male             3.02  Computer Science
54     S00011   28  Female             2.95       Mathematics
55     S00012   25  Female             2.54               Law
56     S00013   22  Female             2.06       Engineering
57     S00014   21    Male             3.21              Arts
58     S00015   25    Male             2.79          Business
59     S00016   25  Female             2.60  Computer Science
60     S00017   20  Female             3.73               Law

In [17]:
print(df)
print(df['Field_of_Study'].dropna())

   Student_ID  Age  Gender  High_School_GPA    Field_of_Study
0      S00001   24    Male             3.58              Arts
1      S00002   21   Other             2.52               Law
2      S00003   28  Female             3.42          Medicine
3      S00004   25    Male             2.43               NaN
4      S00005   22    Male             2.08       Engineering
..        ...  ...     ...              ...               ...
56     S00013   22  Female             2.06       Engineering
57     S00014   21    Male             3.21              Arts
58     S00015   25    Male             2.79          Business
59     S00016   25  Female             2.60  Computer Science
60     S00017   20  Female             3.73               Law

[61 rows x 5 columns]
0                 Arts
1                  Law
2             Medicine
4          Engineering
5                  Law
6     Computer Science
7     Computer Science
8             Business
9     Computer Science
10         Mathematics
11                 Law
12         Engineering
13                Arts
14            Business
15    Computer Science
16                 Law
17         Mathematics
18         Mathematics
19         Mathematics
20            Medicine
21            Business
22         Engineering
23            Medicine
24         Engineering
25            Medicine
26                Arts
27         Engineering
28            Medicine
29         Mathematics
30         Engineering
31            Business
32         Engineering
33                 Law
34         Engineering
35            Medicine
36         Engineering
37                Arts
38    Computer Science
39            Business
40                 Law
41         Mathematics
42            Medicine
43         Mathematics
44         Mathematics
45         Engineering
46         Engineering
47         Engineering
48         Engineering
49                 Law
50    Computer Science
51    Computer Science
52            Business
53    Computer Science
54         Mathematics
55                 Law
56         Engineering
57                Arts
58            Business
59    Computer Science
60                 Law
Name: Field_of_Study, dtype: object

In [19]:
print(df.loc[:,['Field_of_Study','Age']].dropna())

      Field_of_Study  Age
0               Arts   24
1                Law   21
2           Medicine   28
4        Engineering   22
5                Law   24
6   Computer Science   27
7   Computer Science   20
8           Business   24
9   Computer Science   28
10       Mathematics   28
11               Law   25
12       Engineering   22
13              Arts   21
14          Business   25
15  Computer Science   25
16               Law   20
17       Mathematics   23
18       Mathematics   22
19       Mathematics   19
20          Medicine   25
21          Business   29
22       Engineering   23
23          Medicine   19
24       Engineering   29
25          Medicine   22
26              Arts   18
27       Engineering   29
28          Medicine   27
29       Mathematics   23
30       Engineering   29
31          Business   26
32       Engineering   18
33               Law   28
34       Engineering   28
35          Medicine   27
36       Engineering   29
37              Arts   29
38  Computer Science   20
39          Business   29
40               Law   24
41       Mathematics   21
42          Medicine   26
43       Mathematics   20
44       Mathematics   22
45       Engineering   20
46       Engineering   24
47       Engineering   22
48       Engineering   22
49               Law   24
50  Computer Science   27
51  Computer Science   20
52          Business   24
53  Computer Science   28
54       Mathematics   28
55               Law   25
56       Engineering   22
57              Arts   21
58          Business   25
59  Computer Science   25
60               Law   20

In [21]:
print(df.isnull().sum())

Student_ID         0
Age                0
Gender             1
High_School_GPA    1
Field_of_Study     1
dtype: int64

In [25]:
#handling missing values
print(df.fillna('missing'))
print(df.loc[:,["Gender","Field_of_Study"]].fillna(5000000))

   Student_ID  Age  Gender High_School_GPA    Field_of_Study
0      S00001   24    Male            3.58              Arts
1      S00002   21   Other            2.52               Law
2      S00003   28  Female            3.42          Medicine
3      S00004   25    Male            2.43           missing
4      S00005   22    Male            2.08       Engineering
..        ...  ...     ...             ...               ...
56     S00013   22  Female            2.06       Engineering
57     S00014   21    Male            3.21              Arts
58     S00015   25    Male            2.79          Business
59     S00016   25  Female             2.6  Computer Science
60     S00017   20  Female            3.73               Law

[61 rows x 5 columns]
    Gender    Field_of_Study
0     Male              Arts
1    Other               Law
2   Female          Medicine
3     Male           5000000
4     Male       Engineering
..     ...               ...
56  Female       Engineering
57    Male              Arts
58    Male          Business
59  Female  Computer Science
60  Female               Law

[61 rows x 2 columns]

In [27]:
import pandas as pd
df=pd.read_excel("//home//rguktrkvalley//Documents//E2//S2//DSP_LAB//Marks.xlsx")
print(df)

         NAME   AGE    WT   DSP  TOTAL
0        raju   NaN  30.0  34.0     64
1       surya  24.0  23.0  23.0     46
2       kiran  23.0   NaN  29.0     63
3         sam  35.0  23.0  40.0     63
4      sreenu  22.0  29.0   NaN     64
5        ajay  76.0  40.0  37.0     77
6       vijay  27.0  35.0  35.0     70
7     prabhas   NaN  37.0  29.0     66
8       bunny  28.0  37.0  26.0     63
9     anushka  25.0  36.0  24.0     60
10       pspk  37.0  35.0  23.0     58
11     mahesh  34.0  29.0  29.0     58
12        ntr  32.0   NaN  40.0     66
13  ramcharan  31.0  24.0  34.0     58
14        ntr  32.0  26.0  40.0     66
15       ntr   32.0  26.0  40.0     66
16    sreenu   45.0  67.0   NaN     23
17      kiran  23.0  34.0  29.0     63

In [29]:
print(df['WT'].fillna(df['WT'].mean()))

0     30.0000
1     23.0000
2     33.1875
3     23.0000
4     29.0000
5     40.0000
6     35.0000
7     37.0000
8     37.0000
9     36.0000
10    35.0000
11    29.0000
12    33.1875
13    24.0000
14    26.0000
15    26.0000
16    67.0000
17    34.0000
Name: WT, dtype: float64

In [31]:
print(df['WT'].mean())

33.1875

In [41]:
#remove duplicates
import pandas as pd
df=pd.read_excel("//home//rguktrkvalley//Documents//E2//S2//DSP_LAB//Marks.xlsx")
print(df)
print(df.duplicated())

         NAME   AGE    WT   DSP  TOTAL
0        raju   NaN  30.0  34.0     64
1       surya  24.0  23.0  23.0     46
2       kiran  23.0   NaN  29.0     63
3         sam  35.0  23.0  40.0     63
4      sreenu  22.0  29.0   NaN     64
5        ajay  76.0  40.0  37.0     77
6       vijay  27.0  35.0  35.0     70
7     prabhas   NaN  37.0  29.0     66
8       bunny  28.0  37.0  26.0     63
9     anushka  25.0  36.0  24.0     60
10       pspk  37.0  35.0  23.0     58
11     mahesh  34.0  29.0  29.0     58
12        ntr  32.0  33.0  40.0     66
13  ramcharan  31.0  24.0  34.0     58
14        ntr  32.0  33.0  40.0     66
15       ntr   32.0  26.0  40.0     66
16    sreenu   45.0  67.0   NaN     23
17      kiran  23.0  34.0  29.0     63
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14     True
15    False
16    False
17    False
dtype: bool

In [43]:
print(df.drop_duplicates())

         NAME   AGE    WT   DSP  TOTAL
0        raju   NaN  30.0  34.0     64
1       surya  24.0  23.0  23.0     46
2       kiran  23.0   NaN  29.0     63
3         sam  35.0  23.0  40.0     63
4      sreenu  22.0  29.0   NaN     64
5        ajay  76.0  40.0  37.0     77
6       vijay  27.0  35.0  35.0     70
7     prabhas   NaN  37.0  29.0     66
8       bunny  28.0  37.0  26.0     63
9     anushka  25.0  36.0  24.0     60
10       pspk  37.0  35.0  23.0     58
11     mahesh  34.0  29.0  29.0     58
12        ntr  32.0  33.0  40.0     66
13  ramcharan  31.0  24.0  34.0     58
15       ntr   32.0  26.0  40.0     66
16    sreenu   45.0  67.0   NaN     23
17      kiran  23.0  34.0  29.0     63

In [49]:
#gruping

df.groupby('NAME')
print(df.groupby('NAME').groups)
gk=df.groupby('NAME')
print(gk.first())

{'ajay': [5], 'anushka': [9], 'bunny': [8], 'kiran': [2, 17], 'mahesh': [11], 'ntr': [12, 14], 'ntr ': [15], 'prabhas': [7], 'pspk': [10], 'raju': [0], 'ramcharan': [13], 'sam': [3], 'sreenu': [4], 'sreenu ': [16], 'surya': [1], 'vijay': [6]}
            AGE    WT   DSP  TOTAL
NAME
ajay       76.0  40.0  37.0     77
anushka    25.0  36.0  24.0     60
bunny      28.0  37.0  26.0     63
kiran      23.0  34.0  29.0     63
mahesh     34.0  29.0  29.0     58
ntr        32.0  33.0  40.0     66
ntr        32.0  26.0  40.0     66
prabhas     NaN  37.0  29.0     66
pspk       37.0  35.0  23.0     58
raju        NaN  30.0  34.0     64
ramcharan  31.0  24.0  34.0     58
sam        35.0  23.0  40.0     63
sreenu     22.0  29.0   NaN     64
sreenu     45.0  67.0   NaN     23
surya      24.0  23.0  23.0     46
vijay      27.0  35.0  35.0     70

In [51]:
print(df.groupby(['NAME','WT']).groups)

{('ajay', 40.0): [5], ('anushka', 36.0): [9], ('bunny', 37.0): [8], ('kiran', 34.0): [17], ('kiran', nan): [2], ('mahesh', 29.0): [11], ('ntr', 33.0): [12, 14], ('ntr ', 26.0): [15], ('prabhas', 37.0): [7], ('pspk', 35.0): [10], ('raju', 30.0): [0], ('ramcharan', 24.0): [13], ('sam', 23.0): [3], ('sreenu', 29.0): [4], ('sreenu ', 67.0): [16], ('surya', 23.0): [1], ('vijay', 35.0): [6]}

In [57]:
print(df.groupby(['NAME','WT'],sort=True).sum())

                 AGE   DSP  TOTAL
NAME      WT
ajay      40.0  76.0  37.0     77
anushka   36.0  25.0  24.0     60
bunny     37.0  28.0  26.0     63
kiran     34.0  23.0  29.0     63
mahesh    29.0  34.0  29.0     58
ntr       33.0  64.0  80.0    132
ntr       26.0  32.0  40.0     66
prabhas   37.0   0.0  29.0     66
pspk      35.0  37.0  23.0     58
raju      30.0   0.0  34.0     64
ramcharan 24.0  31.0  34.0     58
sam       23.0  35.0  40.0     63
sreenu    29.0  22.0   0.0     64
sreenu    67.0  45.0   0.0     23
surya     23.0  24.0  23.0     46
vijay     35.0  27.0  35.0     70

In [63]:
grp=df.groupby('NAME')
for name,group in grp:
    print(name)
    print(group)
    print()

print(grp.get_group('ntr'))

ajay
   NAME   AGE    WT   DSP  TOTAL
5  ajay  76.0  40.0  37.0     77

anushka
      NAME   AGE    WT   DSP  TOTAL
9  anushka  25.0  36.0  24.0     60

bunny
    NAME   AGE    WT   DSP  TOTAL
8  bunny  28.0  37.0  26.0     63

kiran
     NAME   AGE    WT   DSP  TOTAL
2   kiran  23.0   NaN  29.0     63
17  kiran  23.0  34.0  29.0     63

mahesh
      NAME   AGE    WT   DSP  TOTAL
11  mahesh  34.0  29.0  29.0     58

ntr
   NAME   AGE    WT   DSP  TOTAL
12  ntr  32.0  33.0  40.0     66
14  ntr  32.0  33.0  40.0     66

ntr
    NAME   AGE    WT   DSP  TOTAL
15  ntr   32.0  26.0  40.0     66

prabhas
      NAME  AGE    WT   DSP  TOTAL
7  prabhas  NaN  37.0  29.0     66

pspk
    NAME   AGE    WT   DSP  TOTAL
10  pspk  37.0  35.0  23.0     58

raju
   NAME  AGE    WT   DSP  TOTAL
0  raju  NaN  30.0  34.0     64

ramcharan
         NAME   AGE    WT   DSP  TOTAL
13  ramcharan  31.0  24.0  34.0     58

sam
  NAME   AGE    WT   DSP  TOTAL
3  sam  35.0  23.0  40.0     63

sreenu
     NAME   AGE    WT  DSP  TOTAL
4  sreenu  22.0  29.0  NaN     64

sreenu
       NAME   AGE    WT  DSP  TOTAL
16  sreenu   45.0  67.0  NaN     23

surya
    NAME   AGE    WT   DSP  TOTAL
1  surya  24.0  23.0  23.0     46

vijay
    NAME   AGE    WT   DSP  TOTAL
6  vijay  27.0  35.0  35.0     70

   NAME   AGE    WT   DSP  TOTAL
12  ntr  32.0  33.0  40.0     66
14  ntr  32.0  33.0  40.0     66

In [65]:
print(grp.sum())

            AGE    WT   DSP  TOTAL
NAME
ajay       76.0  40.0  37.0     77
anushka    25.0  36.0  24.0     60
bunny      28.0  37.0  26.0     63
kiran      46.0  34.0  58.0    126
mahesh     34.0  29.0  29.0     58
ntr        64.0  66.0  80.0    132
ntr        32.0  26.0  40.0     66
prabhas     0.0  37.0  29.0     66
pspk       37.0  35.0  23.0     58
raju        0.0  30.0  34.0     64
ramcharan  31.0  24.0  34.0     58
sam        35.0  23.0  40.0     63
sreenu     22.0  29.0   0.0     64
sreenu     45.0  67.0   0.0     23
surya      24.0  23.0  23.0     46
vijay      27.0  35.0  35.0     70

In [69]:
print(grp.count())

           AGE  WT  DSP  TOTAL
NAME
ajay         1   1    1      1
anushka      1   1    1      1
bunny        1   1    1      1
kiran        2   1    2      2
mahesh       1   1    1      1
ntr          2   2    2      2
ntr          1   1    1      1
prabhas      0   1    1      1
pspk         1   1    1      1
raju         0   1    1      1
ramcharan    1   1    1      1
sam          1   1    1      1
sreenu       1   1    0      1
sreenu       1   1    0      1
surya        1   1    1      1
vijay        1   1    1      1

print(grp)